Revit 2027 API
ParameterTypeId.RebarShapeCrankEndRatio Property
 "End Crank Slope 1:"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeCrankEndRatio { get; }
Public Shared ReadOnly Property RebarShapeCrankEndRatio As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeCrankEndRatio {
	ForgeTypeId^ get ();
}
static member RebarShapeCrankEndRatio : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace